RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/drivers/fsl_clock.h
    kPLL0_to_PLLCLKDIV = MUX_A(CM_PLLCLKDIVSEL, 0), /*!< Attach PLL0 to PLLCLKDIV. */
    kPLL1_to_PLLCLKDIV = MUX_A(CM_PLLCLKDIVSEL, 1), /*!< Attach PLL1 to PLLCLKDIV. */
    kNONE_to_PLLCLKDIV = MUX_A(CM_PLLCLKDIVSEL, 7), /*!< Attach NONE to PLLCLKDIV. */

    kMAIN_CLK_to_I3CFCLK   = MUX_A(CM_I3CFCLKSEL, 0), /*!< Attach MAIN_CLK to I3CFCLK. */
    kFRO_HF_DIV_to_I3CFCLK = MUX_A(CM_I3CFCLKSEL, 1), /*!< Attach FRO_HF_DIV to I3CFCLK. */
    kNONE_to_I3CFCLK       = MUX_A(CM_I3CFCLKSEL, 7), /*!< Attach NONE to I3CFCLK. */

    kI3CFCLKSEL_to_I3CFCLKSTC = MUX_A(CM_I3CFCLKSTCSEL, 0), /*!< Attach I3CFCLKSEL to I3CFCLKSTC. */
    kFRO1M_to_I3CFCLKSTC      = MUX_A(CM_I3CFCLKSTCSEL, 1), /*!< Attach FRO1M to I3CFCLKSTC. */
    kNONE_to_I3CFCLKSTC       = MUX_A(CM_I3CFCLKSTCSEL, 7), /*!< Attach NONE to I3CFCLKSTC. */

    kMAIN_CLK_to_DMIC = MUX_A(CM_DMICFCLKSEL, 0), /*!< Attach MAIN_CLK to DMIC. */
    kPLL0_to_DMIC     = MUX_A(CM_DMICFCLKSEL, 1), /*!< Attach PLL0 to DMIC. */
    kEXT_CLK_to_DMIC  = MUX_A(CM_DMICFCLKSEL, 2), /*!< Attach EXT_CLK to DMIC. */
    kFRO_HF_to_DMIC   = MUX_A(CM_DMICFCLKSEL, 3), /*!< Attach FRO_HF to DMIC. */
    kPLL1_to_DMIC     = MUX_A(CM_DMICFCLKSEL, 2), /*!< Attach PLL1 to DMIC. */
    kMCLK_IN_to_DMIC  = MUX_A(CM_DMICFCLKSEL, 5), /*!< Attach MCLK_IN to DMIC. */
    kNONE_to_DMIC     = MUX_A(CM_DMICFCLKSEL, 7), /*!< Attach NONE to DMIC. */

    kFRO32K_to_FCOSC32K  = MUX_A(CM_FC32KCLKSEL, 0),     /*!< Attach FRO32K to FCOSC32K. */
    kXTAL32K_to_FCOSC32K = MUX_A(CM_FC32KCLKSEL, 1),     /*!< Attach XTAL32K to FCOSC32K. */
    kFRO32K_to_OSC32K    = MUX_A(CM_RTCOSC32KCLKSEL, 0), /*!< Attach FRO32K to OSC32K. */
    kXTAL32K_to_OSC32K   = MUX_A(CM_RTCOSC32KCLKSEL, 1), /*!< Attach XTAL32K to OSC32K. */
    kFRO32K_to_FC32K     = MUX_A(CM_FC32KCLKSEL, 0),     /*!< Attach FRO32K to FC32K. */
    kXTAL32K_to_FC32K    = MUX_A(CM_FC32KCLKSEL, 1),     /*!< Attach XTAL32K to FC32K. */

    kFRO32K_to_OSTIMER  = MUX_A(CM_OSTIMERCLKSEL, 0), /*!< Attach FRO32K to OSTIMER. */
    kOSC32K_to_OSTIMER  = MUX_A(CM_OSTIMERCLKSEL, 1), /*!< Attach OSC32K to OSTIMER. */
    kFRO1M_to_OSTIMER   = MUX_A(CM_OSTIMERCLKSEL, 2), /*!< Attach FRO1M to OSTIMER. */
    kAHB_CLK_to_OSTIMER = MUX_A(CM_OSTIMERCLKSEL, 3), /*!< Attach AHB_CLK to OSTIMER. */

    kNONE_to_NONE = (int)0x80000000U, /*!< Attach NONE to NONE. */

} clock_attach_id_t;

/*  Clock dividers */
typedef enum _clock_div_name
{
    kCLOCK_DivSystickClk  = (0),                   /*!< Systick Clock Divider. */
    kCLOCK_DivArmTrClkDiv = ((0x308 - 0x300) / 4), /*!< Trace Clock Divider. */
    kCLOCK_DivCanClk      = ((0x30C - 0x300) / 4), /*!< Can Clock Divider. */
    kCLOCK_DivFlexFrg0    = ((0x320 - 0x300) / 4), /*!< FRGCTRL0 register. */
    kCLOCK_DivFlexFrg1    = ((0x324 - 0x300) / 4), /*!< FRGCTRL1 register. */
    kCLOCK_DivFlexFrg2    = ((0x328 - 0x300) / 4), /*!< FRGCTRL2 register. */
    kCLOCK_DivFlexFrg3    = ((0x32C - 0x300) / 4), /*!< FRGCTRL3 register. */
    kCLOCK_DivFlexFrg4    = ((0x330 - 0x300) / 4), /*!< FRGCTRL4 register. */
    kCLOCK_DivFlexFrg5    = ((0x334 - 0x300) / 4), /*!< FRGCTRL5 register. */
    kCLOCK_DivFlexFrg6    = ((0x338 - 0x300) / 4), /*!< FRGCTRL6 register. */
    kCLOCK_DivFlexFrg7    = ((0x33C - 0x300) / 4), /*!< FRGCTRL7 register. */
    kCLOCK_DivAhbClk      = ((0x380 - 0x300) / 4), /*!< Ahb Clock Divider. */
    kCLOCK_DivClkOut      = ((0x384 - 0x300) / 4), /*!< Clk Out Divider. */
    kCLOCK_DivFrohfClk    = ((0x388 - 0x300) / 4), /*!< Frohf Divider. */
    kCLOCK_DivWdtClk      = ((0x38C - 0x300) / 4), /*!< Wdt Clock Divider. */
    kCLOCK_DivAdc0Clk     = ((0x394 - 0x300) / 4), /*!< Adc0 Clock Divider. */
    kCLOCK_DivUsb0Clk     = ((0x398 - 0x300) / 4), /*!< Usb0 Clock Divider. */
    kCLOCK_DivMclk        = ((0x3AC - 0x300) / 4), /*!< Mclk Divider. */
    kCLOCK_DivSctClk      = ((0x3B4 - 0x300) / 4), /*!< Sct Clock Divider. */
    kCLOCK_DivPllClk      = ((0x3C4 - 0x300) / 4), /*!< Pll0 Clock Divider. */
    kCLOCK_DivCtimer0Clk  = ((0x3D0 - 0x300) / 4), /*!< Ctimer0 Clock Divider. */
    kCLOCK_DivCtimer1Clk  = ((0x3D4 - 0x300) / 4), /*!< Ctimer1 Clock Divider. */
    kCLOCK_DivCtimer2Clk  = ((0x3D8 - 0x300) / 4), /*!< Ctimer2 Clock Divider. */
    kCLOCK_DivCtimer3Clk  = ((0x3DC - 0x300) / 4), /*!< Ctimer3 Clock Divider. */
    kCLOCK_DivCtimer4Clk  = ((0x3E0 - 0x300) / 4), /*!< Ctimer4 Clock Divider. */
    kCLOCK_DivAdc1Clk     = ((0x468 - 0x300) / 4), /*!< Adc1 Clock Divider. */
    kCLOCK_DivDac0Clk     = ((0x494 - 0x300) / 4), /*!< Dac0 Clock Divider. */
    kCLOCK_DivDac1Clk     = ((0x49C - 0x300) / 4), /*!< Dac1 Clock Divider. */
    kCLOCK_DivDac2Clk     = ((0x4A4 - 0x300) / 4), /*!< Dac2 Clock Divider. */
    kCLOCK_DivFlexSpiClk  = ((0x4AC - 0x300) / 4), /*!< Flex Spi Clock Divider. */
    kCLOCK_DivI3cFclkStc  = ((0x538 - 0x300) / 4), /*!< I3c Fclk Stc Divider. */
    kCLOCK_DivI3cFclkS    = ((0x53C - 0x300) / 4), /*!< I3c Fclk S Divider. */
    kCLOCK_DivI3cFclk     = ((0x540 - 0x300) / 4), /*!< I3c Fclk Divider. */
    kCLOCK_DivDmicClk     = ((0x54C - 0x300) / 4), /*!< Dmic Clock Divider. */
    kCLOCK_DivFlexcom0Clk = ((0x850 - 0x300) / 4), /*!< Flexcom0 Clock Divider. */
    kCLOCK_DivFlexcom1Clk = ((0x854 - 0x300) / 4), /*!< Flexcom1 Clock Divider. */
    kCLOCK_DivFlexcom2Clk = ((0x858 - 0x300) / 4), /*!< Flexcom2 Clock Divider. */
    kCLOCK_DivFlexcom3Clk = ((0x85C - 0x300) / 4), /*!< Flexcom3 Clock Divider. */
    kCLOCK_DivFlexcom4Clk = ((0x860 - 0x300) / 4), /*!< Flexcom4 Clock Divider. */
    kCLOCK_DivFlexcom5Clk = ((0x864 - 0x300) / 4), /*!< Flexcom5 Clock Divider. */
    kCLOCK_DivFlexcom6Clk = ((0x868 - 0x300) / 4), /*!< Flexcom6 Clock Divider. */
    kCLOCK_DivFlexcom7Clk = ((0x86C - 0x300) / 4), /*!< Flexcom7 Clock Divider. */
} clock_div_name_t;

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */
/**
 * @brief Enable the clock for specific IP.
 * @param clk : Clock to be enabled.
 * @return  Nothing
 */
static inline void CLOCK_EnableClock(clock_ip_name_t clk)
{
    uint32_t index               = CLK_GATE_ABSTRACT_REG_OFFSET(clk);
    SYSCON->AHBCLKCTRLSET[index] = (1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
}
/**
 * @brief Disable the clock for specific IP.
 * @param clk : Clock to be Disabled.
 * @return  Nothing
 */
static inline void CLOCK_DisableClock(clock_ip_name_t clk)
{
    uint32_t index               = CLK_GATE_ABSTRACT_REG_OFFSET(clk);
    SYSCON->AHBCLKCTRLCLR[index] = (1UL << CLK_GATE_ABSTRACT_BITS_SHIFT(clk));
}
/**
 * @brief   Initialize the Core clock to given frequency (12, 48 or 96 MHz).
 * Turns on FRO and uses default CCO, if freq is 12000000, then high speed output is off, else high speed output is
 * enabled.
 * @param   iFreq   : Desired frequency (must be one of CLK_FRO_12MHZ or CLK_FRO_48MHZ or CLK_FRO_96MHZ)
 * @return  returns success or fail status.
 */
status_t CLOCK_SetupFROClocking(uint32_t iFreq);
/**
 * @brief	Set the flash wait states for the input freuqency.
 * @param	system_freq_hz	: Input frequency
 * @return	Nothing
 */
void CLOCK_SetFLASHAccessCyclesForFreq(uint32_t system_freq_hz);
/**
 * @brief   Initialize the external osc clock to given frequency.
 * @param   iFreq   : Desired frequency (must be equal to exact rate in Hz)
 * @return  returns success or fail status.
 */
status_t CLOCK_SetupExtClocking(uint32_t iFreq);
/**
 * @brief   Initialize the I2S MCLK clock to given frequency.
 * @param   iFreq   : Desired frequency (must be equal to exact rate in Hz)
 * @return  returns success or fail status.
 */
status_t CLOCK_SetupI2SMClkClocking(uint32_t iFreq);
/**
 * @brief   Initialize the PLU CLKIN clock to given frequency.
 * @param   iFreq   : Desired frequency (must be equal to exact rate in Hz)
 * @return  returns success or fail status.
 */
status_t CLOCK_SetupPLUClkInClocking(uint32_t iFreq);
/**
 * @brief   Configure the clock selection muxes.
 * @param   connection  : Clock to be configured.
 * @return  Nothing
 */
void CLOCK_AttachClk(clock_attach_id_t connection);
/**
 * @brief   Get the actual clock attach id.
 * This fuction uses the offset in input attach id, then it reads the actual source value in
 * the register and combine the offset to obtain an actual attach id.
 * @param   attachId  : Clock attach id to get.
 * @return  Clock source value.
 */
clock_attach_id_t CLOCK_GetClockAttachId(clock_attach_id_t attachId);
/**
 * @brief   Setup peripheral clock dividers.
 * @param   div_name    : Clock divider name
 * @param divided_by_value: Value to be divided
 * @param reset :  Whether to reset the divider counter.
 * @return  Nothing
 */
void CLOCK_SetClkDiv(clock_div_name_t div_name, uint32_t divided_by_value, bool reset);
/*! @brief  Return Frequency of selected clock
 *  @return Frequency of selected clock
 */
uint32_t CLOCK_GetFreq(clock_name_t clockName);
/*! @brief  Return Frequency of FRO 12MHz
 *  @return Frequency of FRO 12MHz
 */
uint32_t CLOCK_GetFro12MFreq(void);
/*! @brief  Return Frequency of FRO 1MHz
 *  @return Frequency of FRO 1MHz
 */
uint32_t CLOCK_GetFro1MFreq(void);
/*! @brief  Return Frequency of ClockOut
 *  @return Frequency of ClockOut
 */
uint32_t CLOCK_GetClockOutClkFreq(void);
/*! @brief  Return Frequency of Can Clock
 *  @return Frequency of Can.
 */
uint32_t CLOCK_GetMCanClkFreq(void);
/*! @brief  Return Frequency of Adc Clock
 *  @return Frequency of Adc.
 */
uint32_t CLOCK_GetAdcClkFreq(uint32_t id);
/*! @brief  Return Frequency of Usb0 Clock
 *  @return Frequency of Usb0 Clock.
 */
uint32_t CLOCK_GetUsb0ClkFreq(void);
/*! @brief  Return Frequency of MClk Clock
 *  @return Frequency of MClk Clock.
 */
uint32_t CLOCK_GetMclkClkFreq(void);
/*! @brief  Return Frequency of SCTimer Clock
 *  @return Frequency of SCTimer Clock.
 */
uint32_t CLOCK_GetSctClkFreq(void);
/*! @brief  Return Frequency of External Clock
 *  @return Frequency of External Clock. If no external clock is used returns 0.
 */
uint32_t CLOCK_GetExtClkFreq(void);
/*! @brief  Return Frequency of Watchdog
 *  @return Frequency of Watchdog
 */
uint32_t CLOCK_GetWdtClkFreq(void);
/*! @brief  Return Frequency of High-Freq output of FRO
 *  @return Frequency of High-Freq output of FRO
 */
uint32_t CLOCK_GetFroHfFreq(void);
/*! @brief  Return Frequency of PLL
 *  @return Frequency of PLL
 */
uint32_t CLOCK_GetPll0OutFreq(void);
/*! @brief  Return Frequency of USB PLL
 *  @return Frequency of PLL
 */
uint32_t CLOCK_GetPll1OutFreq(void);
/*! @brief  Return Frequency of PLL_CLK_DIV
 *  @return Frequency of PLL_CLK_DIV
 */
uint32_t CLOCK_GetPllClkDivFreq(void);
/*! @brief  Return Frequency of 32kHz osc
 *  @return Frequency of 32kHz osc
 */
uint32_t CLOCK_GetOsc32KFreq(void);
/*! @brief  Return Frequency of Flexcomm 32kHz osc
 *  @return Frequency of Flexcomm 32kHz osc
 */
uint32_t CLOCK_GetFC32KFreq(void);
/*! @brief  Return Frequency of Core System
 *  @return Frequency of Core System
 */
uint32_t CLOCK_GetCoreSysClkFreq(void);
/*! @brief  Return Frequency of I2S MCLK Clock
 *  @return Frequency of I2S MCLK Clock
 */
uint32_t CLOCK_GetI2SMClkFreq(void);
/*! @brief  Return Frequency of FRG Clock
 *  @return Frequency of FRG Clock
 */
uint32_t CLOCK_GetFrgFreq(uint32_t id);
/*! @brief  Return Frequency of FlexComm Clock
 *  @return Frequency of FlexComm Clock
 */
uint32_t CLOCK_GetFlexCommClkFreq(uint32_t id);
/*! @brief  Return Frequency of High speed SPI Clock
 *  @return Frequency of High speed SPI Clock
 */
uint32_t CLOCK_GetHsLspiClkFreq(void);
/*! @brief  Return Frequency of CTimer functional Clock
 *  @return Frequency of CTimer functional Clock
 */
uint32_t CLOCK_GetCTimerClkFreq(uint32_t id);
/*! @brief  Return Frequency of SystickClock
 *  @return Frequency of Systick Clock
 */
uint32_t CLOCK_GetSystickClkFreq(void);

